recipes/hearty-lentil-soup.org
#+TITLE: Hearty Lentil Soup
#+DATE: 2022-09-04
#+SETUPFILE: recipe.setup

[[https://elavegan.com/best-lentil-soup-recipe/#recipe][Original link]]

* Ingredients
- 1 tbsp olive oil
- 1 cup onion (1 medium-sized) diced
- 3 big garlic cloves minced
- 1 small head of (400 g) cauliflower chopped
- 1 cup carrots chopped
- 3 cups (600 g) dried lentils brown or green, rinsed and drained
- 14 oz can (400 g) chopped tomatoes
- 8 cups (2 liters) vegetable broth
- 1 1/2 tsp onion powder
- 1 tsp ground cumin
- 1 tsp fresh ginger minced
- 1/2 tsp ground coriander
- 1/2 tsp ground caraway seeds
- 1/2 tsp smoked paprika powder
- 1/2 tsp turmeric powder
- 1/2 tsp coconut sugar or brown sugar
- Sea salt and pepper to taste
- Red pepper flakes to taste
- 2 dried whole bay leaves
- 2 tbsp tamari (or coconut aminos)
- 1 tbsp balsamic vinegar
- 1/8 cup (30 ml) coconut cream or dairy-free half and half

* Instructions
1. Heat oil in a LARGE pot over medium heat and add the chopped onion. Saute for 3 minutes, then add garlic, ginger, carrot, and celery, and saute for 3 more minutes.
1. Add all spices, lentils, cauliflower, and vegetable broth and bring to a boil.
1. Now add the bay leaves and cook the soup with a lid on for about 5 minutes.
1. Then add the chopped tomatoes and stir. Let the soup simmer for a further 20-25 minutes or until the lentils are cooked but not mushy.
1. Finally, remove the bay leaves, add the tamari (or coconut aminos), balsamic vinegar, and coconut cream, and stir.
1. Optionally blend the soup partially, garnish with fresh herbs, and enjoy!
