recipes/hearty-lentil-soup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hearty Lentil Soup</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Hearty Lentil Soup</h1>
<p>
<a href="https://elavegan.com/best-lentil-soup-recipe/#recipe">Original link</a>
</p>

<div id="outline-container-org078ed71" class="outline-2">
<h2 id="org078ed71">Ingredients</h2>
<div class="outline-text-2" id="text-org078ed71">
<ul class="org-ul">
<li>1 tbsp olive oil</li>
<li>1 cup onion (1 medium-sized) diced</li>
<li>3 big garlic cloves minced</li>
<li>1 small head of (400 g) cauliflower chopped</li>
<li>1 cup carrots chopped</li>
<li>3 cups (600 g) dried lentils brown or green, rinsed and drained</li>
<li>14 oz can (400 g) chopped tomatoes</li>
<li>8 cups (2 liters) vegetable broth</li>
<li>1 1/2 tsp onion powder</li>
<li>1 tsp ground cumin</li>
<li>1 tsp fresh ginger minced</li>
<li>1/2 tsp ground coriander</li>
<li>1/2 tsp ground caraway seeds</li>
<li>1/2 tsp smoked paprika powder</li>
<li>1/2 tsp turmeric powder</li>
<li>1/2 tsp coconut sugar or brown sugar</li>
<li>Sea salt and pepper to taste</li>
<li>Red pepper flakes to taste</li>
<li>2 dried whole bay leaves</li>
<li>2 tbsp tamari (or coconut aminos)</li>
<li>1 tbsp balsamic vinegar</li>
<li>1/8 cup (30 ml) coconut cream or dairy-free half and half</li>
</ul>
</div>
</div>

<div id="outline-container-orge00a0c0" class="outline-2">
<h2 id="orge00a0c0">Instructions</h2>
<div class="outline-text-2" id="text-orge00a0c0">
<ol class="org-ol">
<li>Heat oil in a LARGE pot over medium heat and add the chopped onion. Saute for 3 minutes, then add garlic, ginger, carrot, and celery, and saute for 3 more minutes.</li>
<li>Add all spices, lentils, cauliflower, and vegetable broth and bring to a boil.</li>
<li>Now add the bay leaves and cook the soup with a lid on for about 5 minutes.</li>
<li>Then add the chopped tomatoes and stir. Let the soup simmer for a further 20-25 minutes or until the lentils are cooked but not mushy.</li>
<li>Finally, remove the bay leaves, add the tamari (or coconut aminos), balsamic vinegar, and coconut cream, and stir.</li>
<li>Optionally blend the soup partially, garnish with fresh herbs, and enjoy!</li>
</ol>
</div>
</div>
</div>
</body>
</html>
